[Killed] BlockStatement
src/components/App/App.tsx:12:49
 import { Message } from '@components/Message';
 import { app, title, todosCount } from './AppStyle';
 
-const App: FC<React.ReactNode> = observer(() => {
-  const { active, done, getTodos } = TodoStore;
-
-  useEffect(() => {
-    getTodos();
-  }, []);
-
-  return (
-    <div css={app}>
-      <GitLink />
-      <div css={title}>
-        <h1>Todo list</h1>
-        <p css={todosCount}>
-          {active} more to do, {done} done
-        </p>
-      </div>
-      <TodoAdd />
-      <Search />
-      <TodoList />
-      <Message>Add todo</Message>
-      <Loader />
-    </div>
-  );
-});
+const App: FC<React.ReactNode> = observer(() => {});
 
 export { App };
killedBy: TodoApp component render check
statusReason: Error: wrappedComponent(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] BlockStatement
src/components/App/App.tsx:15:19
 const App: FC<React.ReactNode> = observer(() => {
   const { active, done, getTodos } = TodoStore;
 
-  useEffect(() => {
-    getTodos();
-  }, []);
+  useEffect(() => {}, []);
 
   return (
