[Killed] BlockStatement
src/components/Btn/Btn.tsx:18:7
   isDisabled,
   isActive,
   testid,
-}) => {
-  const typedObj: LooseObject = btn;
-
-  return (
-    <button
-      css={
-        isActive
-          ? [typedObj[`${styleBtn}`], btn.active]
-          : typedObj[`${styleBtn}`]
-      }
-      data-testid={testid}
-      type={type || 'button'}
-      name={name}
-      onClick={handleClick}
-      disabled={isDisabled}
-    >
-      {children}
-    </button>
-  );
-};
+}) => {};
 
 export { Btn };
killedBy: TodoApp component render check
statusReason: Error: Btn(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] ArrayDeclaration
src/components/Btn/Btn.tsx:25:13
     <button
       css={
         isActive
-          ? [typedObj[`${styleBtn}`], btn.active]
+          ? []
           : typedObj[`${styleBtn}`]
       }

[Timeout] ConditionalExpression
src/components/Btn/Btn.tsx:29:13
           : typedObj[`${styleBtn}`]
       }
       data-testid={testid}
-      type={type || 'button'}
+      type={false}
       name={name}
       onClick={handleClick}

[Timeout] LogicalOperator
src/components/Btn/Btn.tsx:29:13
           : typedObj[`${styleBtn}`]
       }
       data-testid={testid}
-      type={type || 'button'}
+      type={type && 'button'}
       name={name}
       onClick={handleClick}
