[Timeout] StringLiteral
src/components/Btn/BtnStyle.ts:22:29
   }
 `;
 
-export const deleteBtn = css`
-  ${baseBtn}
-  border: 1px solid ${color.primary};
-
-  color: ${color.primary};
-
-  &:enabled:hover {
-    border-color: ${color.primary};
-
-    color: ${color['white-color']};
-
-    background-color: ${color.primary};
-  }
-`;
+export const deleteBtn = css``;
 
 export const markBtn = css`

[Timeout] StringLiteral
src/components/Btn/BtnStyle.ts:31:20
   &:enabled:hover {
     border-color: ${color.primary};
 
-    color: ${color['white-color']};
+    color: ${color[""]};
 
     background-color: ${color.primary};

[Timeout] StringLiteral
src/components/Btn/BtnStyle.ts:37:27
   }
 `;
 
-export const markBtn = css`
-  ${baseBtn}
-  border: 1px solid ${color['green-color']};
-
-  color: ${color['green-color']};
-
-  &:enabled:hover {
-    border-color: ${color['green-color']};
-
-    color: ${color['white-color']};
-
-    background-color: ${color['green-color']};
-  }
-`;
+export const markBtn = css``;
 
 export const manageBtn = css`

[Timeout] StringLiteral
src/components/Btn/BtnStyle.ts:41:18
   ${baseBtn}
   border: 1px solid ${color['green-color']};
 
-  color: ${color['green-color']};
+  color: ${color[""]};
 
   &:enabled:hover {

[Timeout] StringLiteral
src/components/Btn/BtnStyle.ts:44:27
   color: ${color['green-color']};
 
   &:enabled:hover {
-    border-color: ${color['green-color']};
+    border-color: ${color[""]};
 
     color: ${color['white-color']};

[Timeout] StringLiteral
src/components/Btn/BtnStyle.ts:57:18
   border: 1px solid ${color['blue-color']};
   border-radius: 7px;
 
-  color: ${color['blue-color']};
+  color: ${color[""]};
   font-weight: 600;
 

[Timeout] StringLiteral
src/components/Btn/BtnStyle.ts:63:27
   box-shadow: 0 14px 28px rgb(0 0 0 / 25%), 0 10px 10px rgb(0 0 0 / 22%);
   transition: all 0.2s ease;
   &:disabled {
-    border-color: ${color['gray-color']};
+    border-color: ${color[""]};
 
     color: ${color['gray-color']};

[Timeout] StringLiteral
src/components/Btn/BtnStyle.ts:75:20
     cursor: pointer;
   }
   &:enabled.active {
-    color: ${color['white-color']};
+    color: ${color[""]};
   }
   &:enabled:hover {

[Timeout] StringLiteral
src/components/Btn/BtnStyle.ts:78:27
     color: ${color['white-color']};
   }
   &:enabled:hover {
-    border-color: ${color['green-color--light']};
+    border-color: ${color[""]};
 
     color: ${color['white-color']};

[Survived] StringLiteral
src/components/Btn/BtnStyle.ts:91:26
   }
 `;
 
-export const active = css`
-  border-color: ${color['green-color--light']};
-
-  color: ${color['white-color']}!important;
-
-  background-color: ${color['green-color--light']};
-  box-shadow: none;
-`;
+export const active = css``;
 

[Survived] StringLiteral
src/components/Btn/BtnStyle.ts:92:25
 `;
 
 export const active = css`
-  border-color: ${color['green-color--light']};
+  border-color: ${color[""]};
 
   color: ${color['white-color']}!important;

[Survived] StringLiteral
src/components/Btn/BtnStyle.ts:96:29
 
   color: ${color['white-color']}!important;
 
-  background-color: ${color['green-color--light']};
+  background-color: ${color[""]};
   box-shadow: none;
 `;
