[Killed] BlockStatement
src/components/Input/Input.tsx:15:9
     handleChange,
     className,
     testid,
-  }) => {
-    return (
-      <input
-        value={value}
-        onChange={handleChange}
-        onKeyDown={handleKey}
-        data-testid={testid}
-        css={input}
-        type="text"
-        name={name}
-        placeholder={placeholder}
-        className={className}
-      />
-    );
-  },
+  }) => {},
 );
 
killedBy: TodoApp component render check
statusReason: Error: wrappedComponent(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
