[Survived] StringLiteral
src/components/Input/InputStyle.ts:14:27
 
   transition: all 0.2s ease;
   &:focus {
-    border-color: ${color['green-color--light']};
+    border-color: ${color[""]};
   }
 `;
