[Killed] BlockStatement
src/components/Loader/Loader.tsx:6:31
 import { TodoStore } from '@src/store';
 import { observer } from 'mobx-react';
 
-const Loader = observer(() => {
-  const { isLoading } = TodoStore;
-
-  if (!isLoading) return null;
-
-  return <div css={loader} />;
-});
+const Loader = observer(() => {});
 
 export { Loader };
killedBy: TodoApp component render check
statusReason: Error: wrappedComponent(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] ConditionalExpression
src/components/Loader/Loader.tsx:9:7
 const Loader = observer(() => {
   const { isLoading } = TodoStore;
 
-  if (!isLoading) return null;
+  if (false) return null;
 
   return <div css={loader} />;

[Survived] BooleanLiteral
src/components/Loader/Loader.tsx:9:7
 const Loader = observer(() => {
   const { isLoading } = TodoStore;
 
-  if (!isLoading) return null;
+  if (isLoading) return null;
 
   return <div css={loader} />;
