[Killed] BlockStatement
src/components/Message/Message.tsx:5:59
 import { TodoStore } from '@src/store';
 import { observer } from 'mobx-react';
 
-const Message: FC<ReactNode> = observer(({ children }) => {
-  const { isLoading, renderTodos } = TodoStore;
-
-  if (isLoading || renderTodos.length) return null;
-
-  return <div>{children}</div>;
-});
+const Message: FC<ReactNode> = observer(({ children }) => {});
 
 export { Message };
killedBy: TodoApp component render check
statusReason: Error: wrappedComponent(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] LogicalOperator
src/components/Message/Message.tsx:8:7
 const Message: FC<ReactNode> = observer(({ children }) => {
   const { isLoading, renderTodos } = TodoStore;
 
-  if (isLoading || renderTodos.length) return null;
+  if (isLoading && renderTodos.length) return null;
 
   return <div>{children}</div>;

[Survived] ConditionalExpression
src/components/Message/Message.tsx:8:7
 const Message: FC<ReactNode> = observer(({ children }) => {
   const { isLoading, renderTodos } = TodoStore;
 
-  if (isLoading || renderTodos.length) return null;
+  if (true) return null;
 
   return <div>{children}</div>;
