[Killed] ArrowFunction
src/components/Search/Search.tsx:11:21
 const Search: FC = observer(() => {
   const { query, setQuery, sortType, setSortType, todoFilter } = TodoStore;
 
-  const handleKey = (e: KeyboardEvent<HTMLInputElement>) =>
-    e.key === 'Enter' ? todoFilter(query) : undefined;
+  const handleKey = () => undefined;
 
   const handleChange = (e: ChangeEvent<HTMLInputElement>) =>
killedBy: Search check input field
statusReason: Error: expect(received).toBeNull()

Received: <div class="css-0" data-testid="todoItemTitle">Todo content</div>

[Killed] EqualityOperator
src/components/Search/Search.tsx:12:5
   const { query, setQuery, sortType, setSortType, todoFilter } = TodoStore;
 
   const handleKey = (e: KeyboardEvent<HTMLInputElement>) =>
-    e.key === 'Enter' ? todoFilter(query) : undefined;
+    e.key !== 'Enter' ? todoFilter(query) : undefined;
 
   const handleChange = (e: ChangeEvent<HTMLInputElement>) =>
killedBy: Search check input field
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
src/components/Search/Search.tsx:12:5
   const { query, setQuery, sortType, setSortType, todoFilter } = TodoStore;
 
   const handleKey = (e: KeyboardEvent<HTMLInputElement>) =>
-    e.key === 'Enter' ? todoFilter(query) : undefined;
+    false ? todoFilter(query) : undefined;
 
   const handleChange = (e: ChangeEvent<HTMLInputElement>) =>
killedBy: Search check input field
statusReason: Error: expect(received).toBeNull()

Received: <div class="css-0" data-testid="todoItemTitle">Todo content</div>

[Killed] ArrowFunction
src/components/Search/Search.tsx:14:24
   const handleKey = (e: KeyboardEvent<HTMLInputElement>) =>
     e.key === 'Enter' ? todoFilter(query) : undefined;
 
-  const handleChange = (e: ChangeEvent<HTMLInputElement>) =>
-    setQuery(e.target.value);
+  const handleChange = () => undefined;
 
   const handleClick = (e: MouseEvent<HTMLButtonElement>) => {
killedBy: Search check input field
statusReason: Error: expect(element).toHaveValue(Test)

Expected the element to have value:
  Test
Received:

[Survived] BlockStatement
src/components/Search/Search.tsx:17:61
   const handleChange = (e: ChangeEvent<HTMLInputElement>) =>
     setQuery(e.target.value);
 
-  const handleClick = (e: MouseEvent<HTMLButtonElement>) => {
-    const { name } = e.currentTarget;
-    setSortType(name);
-    todoFilter(query);
-  };
+  const handleClick = (e: MouseEvent<HTMLButtonElement>) => {};
 
   return (

[Survived] EqualityOperator
src/components/Search/Search.tsx:41:21
           styleBtn="manageBtn"
           name="all"
           testid="allBtn"
-          isActive={sortType === 'all'}
+          isActive={sortType !== 'all'}
         >
           All

[Survived] ConditionalExpression
src/components/Search/Search.tsx:41:21
           styleBtn="manageBtn"
           name="all"
           testid="allBtn"
-          isActive={sortType === 'all'}
+          isActive={false}
         >
           All

[Survived] ConditionalExpression
src/components/Search/Search.tsx:51:21
           styleBtn="manageBtn"
           name="active"
           testid="activeBtn"
-          isActive={sortType === 'active'}
+          isActive={false}
         >
           Active

[Survived] EqualityOperator
src/components/Search/Search.tsx:51:21
           styleBtn="manageBtn"
           name="active"
           testid="activeBtn"
-          isActive={sortType === 'active'}
+          isActive={sortType !== 'active'}
         >
           Active

[Survived] ConditionalExpression
src/components/Search/Search.tsx:61:21
           styleBtn="manageBtn"
           name="done"
           testid="doneBtn"
-          isActive={sortType === 'done'}
+          isActive={true}
         >
           Done

[Survived] ConditionalExpression
src/components/Search/Search.tsx:61:21
           styleBtn="manageBtn"
           name="done"
           testid="doneBtn"
-          isActive={sortType === 'done'}
+          isActive={false}
         >
           Done
