[Survived] StringLiteral
src/components/Search/SearchStyle.ts:3:26
 import { css } from '@emotion/react';
 
-export const search = css`
-  display: flex;
-  margin-bottom: 15px;
-`;
+export const search = css``;
 
 export const searchFilter = css`

[Survived] StringLiteral
src/components/Search/SearchStyle.ts:14:31
   gap: 5px;
 `;
 
-export const searchField = css`
-  margin-right: 5px;
-`;
+export const searchField = css``;
 
