[Survived] BooleanLiteral
src/components/TodoAdd/TodoAdd.tsx:15:13
   const initialState: IState = {
     title,
     data: new Date().toLocaleDateString(),
-    status: false,
+    status: true,
     mark: false,
   };

[Survived] BooleanLiteral
src/components/TodoAdd/TodoAdd.tsx:16:11
     title,
     data: new Date().toLocaleDateString(),
     status: false,
-    mark: false,
+    mark: true,
   };
 

[Killed] BlockStatement
src/components/TodoAdd/TodoAdd.tsx:19:29
     mark: false,
   };
 
-  const handleClick = () => {
-    setTodos(initialState);
-    setTitle('');
-  };
+  const handleClick = () => {};
 
   const handleKey = (e: KeyboardEvent<HTMLInputElement>) => {
killedBy: TodoApp check component operation
statusReason: Error: expect(element).not.toHaveValue(Click on button)

Expected the element not to have value:
  Click on button
Received:
  Click on button

[Killed] BlockStatement
src/components/TodoAdd/TodoAdd.tsx:24:61
     setTitle('');
   };
 
-  const handleKey = (e: KeyboardEvent<HTMLInputElement>) => {
-    if (e.key === 'Enter') {
-      setTitle('');
-      return setTodos(initialState);
-    }
-    return undefined;
-  };
+  const handleKey = (e: KeyboardEvent<HTMLInputElement>) => {};
 
   const handleChange = (e: ChangeEvent<HTMLInputElement>) =>
killedBy: TodoApp check component operation
statusReason: Error: expect(element).not.toHaveValue(Press Enter)

Expected the element not to have value:
  Press Enter
Received:
  Press Enter

[Killed] ConditionalExpression
src/components/TodoAdd/TodoAdd.tsx:25:9
   };
 
   const handleKey = (e: KeyboardEvent<HTMLInputElement>) => {
-    if (e.key === 'Enter') {
+    if (true) {
       setTitle('');
       return setTodos(initialState);
killedBy: TodoApp check component operation
statusReason: Error: expect(element).toHaveValue(Press Enter)

Expected the element to have value:
  Press Enter
Received:
  r

[Killed] BlockStatement
src/components/TodoAdd/TodoAdd.tsx:25:28
   };
 
   const handleKey = (e: KeyboardEvent<HTMLInputElement>) => {
-    if (e.key === 'Enter') {
-      setTitle('');
-      return setTodos(initialState);
-    }
+    if (e.key === 'Enter') {}
     return undefined;
   };
killedBy: TodoApp check component operation
statusReason: Error: expect(element).not.toHaveValue(Press Enter)

Expected the element not to have value:
  Press Enter
Received:
  Press Enter

[Killed] StringLiteral
src/components/TodoAdd/TodoAdd.tsx:26:16
 
   const handleKey = (e: KeyboardEvent<HTMLInputElement>) => {
     if (e.key === 'Enter') {
-      setTitle('');
+      setTitle("Stryker was here!");
       return setTodos(initialState);
     }
killedBy: TodoApp check component operation
statusReason: Error: expect(element).toHaveValue(Click on button)

Expected the element to have value:
  Click on button
Received:
  Stryker was here!Click on button

[Killed] ArrowFunction
src/components/TodoAdd/TodoAdd.tsx:32:24
     return undefined;
   };
 
-  const handleChange = (e: ChangeEvent<HTMLInputElement>) =>
-    setTitle(e.target.value);
+  const handleChange = () => undefined;
 
   return (
killedBy: TodoApp check component operation
statusReason: Error: expect(element).toHaveValue(Press Enter)

Expected the element to have value:
  Press Enter
Received:

[Killed] BooleanLiteral
src/components/TodoAdd/TodoAdd.tsx:50:23
         <Btn
           type="button"
           styleBtn="manageBtn"
-          isDisabled={!title}
+          isDisabled={title}
           handleClick={handleClick}
           testid="todoAddBtn"
killedBy: TodoApp check component operation
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="css-2f00cp-manageBtn" data-testid="todoAddBtn" type="button" />
