[Timeout] BlockStatement
src/components/TodoItem/TodoItem.tsx:27:17
   }) => {
     let colorStatus = todoStyle;
 
-    if (status) {
-      colorStatus = todoDoneStyle;
-    } else if (!status && mark) {
+    if (status) {} else if (!status && mark) {
       colorStatus = markStyle;
     }

[Timeout] ConditionalExpression
src/components/TodoItem/TodoItem.tsx:27:9
   }) => {
     let colorStatus = todoStyle;
 
-    if (status) {
+    if (true) {
       colorStatus = todoDoneStyle;
     } else if (!status && mark) {

[Survived] LogicalOperator
src/components/TodoItem/TodoItem.tsx:29:16
 
     if (status) {
       colorStatus = todoDoneStyle;
-    } else if (!status && mark) {
+    } else if (!status || mark) {
       colorStatus = markStyle;
     }

[Timeout] ConditionalExpression
src/components/TodoItem/TodoItem.tsx:29:16
 
     if (status) {
       colorStatus = todoDoneStyle;
-    } else if (!status && mark) {
+    } else if (true) {
       colorStatus = markStyle;
     }

[Killed] ArrowFunction
src/components/TodoItem/TodoItem.tsx:38:18
         aria-hidden="true"
         key={id}
         css={colorStatus}
-        onClick={(e) => handleClickStatus(e)}
+        onClick={() => undefined}
         data-testid="todoItem"
         data-status={status}
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ArrowFunction
src/components/TodoItem/TodoItem.tsx:51:26
         </div>
         <div css={controlBar}>
           <Btn
-            handleClick={() => handleClickDel()}
+            handleClick={() => undefined}
             styleBtn="deleteBtn"
             name="delete"
killedBy: TodoList check component operation
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"data": "2/22/2022", "id": "123", "mark": true, "status": false, "title": "Test"}]

[Killed] ArrowFunction
src/components/TodoItem/TodoItem.tsx:59:26
             Delete
           </Btn>
           <Btn
-            handleClick={() => handleClickMark()}
+            handleClick={() => undefined}
             styleBtn="markBtn"
             name="mark"
killedBy: TodoItem check component operation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] StringLiteral
src/components/TodoItem/TodoItem.tsx:64:21
             name="mark"
             testid="markBtn"
           >
-            {mark ? 'UnMark' : 'Mark'}
+            {mark ? "" : 'Mark'}
           </Btn>
         </div>
