[Survived] StringLiteral
src/components/TodoItem/TodoItemStyle.ts:25:30
   background-color: ${color['black-color--light']};
 `;
 
-export const controlBar = css`
-  display: flex;
-  gap: 5px;
-  justify-content: space-between;
-`;
+export const controlBar = css``;
 
 export const countStyle = css`

[Survived] StringLiteral
src/components/TodoItem/TodoItemStyle.ts:31:30
   justify-content: space-between;
 `;
 
-export const countStyle = css`
-  font-weight: 700;
-  font-size: 22px;
-`;
+export const countStyle = css``;
 
 export const titleDoneStyle = css`
