[Survived] ArithmeticOperator
src/components/TodoList/TodoList.tsx:18:31
           ? [...renderTodos]
               .reverse()
               .map(({ id, title, mark, status }, ind, arr) => {
-                const count = arr.length - ind;
+                const count = arr.length + ind;
 
                 const handleClickDel = () => {

[Killed] BlockStatement
src/components/TodoList/TodoList.tsx:20:46
               .map(({ id, title, mark, status }, ind, arr) => {
                 const count = arr.length - ind;
 
-                const handleClickDel = () => {
-                  deleteTodo(id);
-                };
+                const handleClickDel = () => {};
 
                 const handleClickMark = () => {
killedBy: TodoList check component operation
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"data": "2/22/2022", "id": "123", "mark": true, "status": false, "title": "Test"}]

[Killed] BlockStatement
src/components/TodoList/TodoList.tsx:24:47
                   deleteTodo(id);
                 };
 
-                const handleClickMark = () => {
-                  markTodo(id);
-                };
+                const handleClickMark = () => {};
 
                 const handleClickStatus = (e: MouseEvent<HTMLDivElement>) => {
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/components/TodoList/TodoList.tsx:28:78
                   markTodo(id);
                 };
 
-                const handleClickStatus = (e: MouseEvent<HTMLDivElement>) => {
-                  const target = e.target as typeof e.target & {
-                    getAttribute: (a: string) => string;
-                  };
-                  if (
-                    target.getAttribute &&
-                    target.getAttribute('name') !== 'mark'
-                  ) {
-                    setStatus(id);
-                    todoFilter(query);
-                  }
-                };
+                const handleClickStatus = (e: MouseEvent<HTMLDivElement>) => {};
 
                 return (
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
src/components/TodoList/TodoList.tsx:33:21
                     getAttribute: (a: string) => string;
                   };
                   if (
-                    target.getAttribute &&
-                    target.getAttribute('name') !== 'mark'
+                    false
                   ) {
                     setStatus(id);
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] LogicalOperator
src/components/TodoList/TodoList.tsx:33:21
                     getAttribute: (a: string) => string;
                   };
                   if (
-                    target.getAttribute &&
-                    target.getAttribute('name') !== 'mark'
+                    target.getAttribute || target.getAttribute('name') !== 'mark'
                   ) {
                     setStatus(id);

[Killed] EqualityOperator
src/components/TodoList/TodoList.tsx:34:21
                   };
                   if (
                     target.getAttribute &&
-                    target.getAttribute('name') !== 'mark'
+                    target.getAttribute('name') === 'mark'
                   ) {
                     setStatus(id);
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] ConditionalExpression
src/components/TodoList/TodoList.tsx:34:21
                   };
                   if (
                     target.getAttribute &&
-                    target.getAttribute('name') !== 'mark'
+                    true
                   ) {
                     setStatus(id);

[Killed] BlockStatement
src/components/TodoList/TodoList.tsx:35:21
                   if (
                     target.getAttribute &&
                     target.getAttribute('name') !== 'mark'
-                  ) {
-                    setStatus(id);
-                    todoFilter(query);
-                  }
+                  ) {}
                 };
 
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false
