[Survived] ArrowFunction
Todo/client/src/index.tsx:8:12
 import { App } from '@components/App';
 import { globalStyle } from '@src/styles';
 
-setTimeout(() =>
-  configure({
-    enforceActions: 'never',
-    reactionScheduler: (f) => setTimeout(f),
-  }),
+setTimeout(() => undefined,
 );
 

[Survived] StringLiteral
Todo/client/src/index.tsx:10:21
 
 setTimeout(() =>
   configure({
-    enforceActions: 'never',
+    enforceActions: "",
     reactionScheduler: (f) => setTimeout(f),
   }),

[Survived] ArrowFunction
Todo/client/src/index.tsx:11:24
 setTimeout(() =>
   configure({
     enforceActions: 'never',
-    reactionScheduler: (f) => setTimeout(f),
+    reactionScheduler: () => undefined,
   }),
 );
