[Survived] BlockStatement
client/src/module/request.ts:4:51
 import { axiosInstance } from '@src/utils';
 import { ITodosRequest } from '@src/interfaces';
 
-const createTodo = async (todo: ITodosRequest) => {
-  try {
-    const todoResponse = await axiosInstance({
-      method: 'post',
-      data: todo,
-    });
-
-    return todoResponse;
-  } catch (e: any) {
-    console.log(e.message);
-  }
-};
+const createTodo = async (todo: ITodosRequest) => {};
 
 const getAllTodos = async () => {

[Survived] BlockStatement
client/src/module/request.ts:5:7
 import { ITodosRequest } from '@src/interfaces';
 
 const createTodo = async (todo: ITodosRequest) => {
-  try {
-    const todoResponse = await axiosInstance({
-      method: 'post',
-      data: todo,
-    });
-
-    return todoResponse;
-  } catch (e: any) {
+  try {} catch (e: any) {
     console.log(e.message);
   }

[Survived] BlockStatement
client/src/module/request.ts:12:20
     });
 
     return todoResponse;
-  } catch (e: any) {
-    console.log(e.message);
-  }
+  } catch (e: any) {}
 };
 

[Survived] BlockStatement
client/src/module/request.ts:17:33
   }
 };
 
-const getAllTodos = async () => {
-  try {
-    const response = await axiosInstance({
-      headers: { 'Content-Type': 'applicatoin/json' },
-    });
-
-    return response;
-  } catch (e: any) {
-    console.log(e.message);
-  }
-};
+const getAllTodos = async () => {};
 
 const updateTodo = async (data: ITodosRequest) => {

[Survived] BlockStatement
client/src/module/request.ts:18:7
 };
 
 const getAllTodos = async () => {
-  try {
-    const response = await axiosInstance({
-      headers: { 'Content-Type': 'applicatoin/json' },
-    });
-
-    return response;
-  } catch (e: any) {
+  try {} catch (e: any) {
     console.log(e.message);
   }

[Survived] BlockStatement
client/src/module/request.ts:24:20
     });
 
     return response;
-  } catch (e: any) {
-    console.log(e.message);
-  }
+  } catch (e: any) {}
 };
 

[Survived] BlockStatement
client/src/module/request.ts:29:51
   }
 };
 
-const updateTodo = async (data: ITodosRequest) => {
-  try {
-    await axiosInstance({
-      method: 'put',
-      data,
-    });
-  } catch (e: any) {
-    console.log(e.message);
-  }
-};
+const updateTodo = async (data: ITodosRequest) => {};
 
 const deleteTodo = async (id: string) => {

[Survived] BlockStatement
client/src/module/request.ts:30:7
 };
 
 const updateTodo = async (data: ITodosRequest) => {
-  try {
-    await axiosInstance({
-      method: 'put',
-      data,
-    });
-  } catch (e: any) {
+  try {} catch (e: any) {
     console.log(e.message);
   }

[Survived] BlockStatement
client/src/module/request.ts:35:20
       method: 'put',
       data,
     });
-  } catch (e: any) {
-    console.log(e.message);
-  }
+  } catch (e: any) {}
 };
 

[Survived] BlockStatement
client/src/module/request.ts:40:42
   }
 };
 
-const deleteTodo = async (id: string) => {
-  try {
-    await axiosInstance({
-      url: `${id}`,
-      method: 'delete',
-    });
-  } catch (e: any) {
-    console.log(e.message);
-  }
-};
+const deleteTodo = async (id: string) => {};
 
 export { getAllTodos, createTodo, updateTodo, deleteTodo };

[Survived] BlockStatement
client/src/module/request.ts:41:7
 };
 
 const deleteTodo = async (id: string) => {
-  try {
-    await axiosInstance({
-      url: `${id}`,
-      method: 'delete',
-    });
-  } catch (e: any) {
+  try {} catch (e: any) {
     console.log(e.message);
   }

[Survived] ObjectLiteral
client/src/module/request.ts:42:25
 
 const deleteTodo = async (id: string) => {
   try {
-    await axiosInstance({
-      url: `${id}`,
-      method: 'delete',
-    });
+    await axiosInstance({});
   } catch (e: any) {
     console.log(e.message);

[Survived] StringLiteral
client/src/module/request.ts:43:12
 const deleteTodo = async (id: string) => {
   try {
     await axiosInstance({
-      url: `${id}`,
+      url: ``,
       method: 'delete',
     });
