[Killed] BlockStatement
client/src/store/todo.store.ts:7:17
 import { delay } from '@utils/delay.utils';
 
 class Store {
-  constructor() {
-    makeAutoObservable(this);
-  }
+  constructor() {}
 
   isLoading = false;
killedBy: Search check input field
statusReason: Error: expect(element).toHaveValue(Test)

Expected the element to have value:
  Test
Received:

[Survived] BooleanLiteral
client/src/store/todo.store.ts:11:15
     makeAutoObservable(this);
   }
 
-  isLoading = false;
+  isLoading = true;
   requestError = null;
   todos: ITodos[] = [];

[Killed] StringLiteral
client/src/store/todo.store.ts:15:11
   requestError = null;
   todos: ITodos[] = [];
   renderTodos: ITodos[] = [];
-  title = '';
+  title = "Stryker was here!";
   query = '';
   sortType = 'all';
killedBy: TodoApp check component operation
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="css-2f00cp-manageBtn" data-testid="todoAddBtn" type="button" />

[Killed] StringLiteral
client/src/store/todo.store.ts:16:11
   todos: ITodos[] = [];
   renderTodos: ITodos[] = [];
   title = '';
-  query = '';
+  query = "Stryker was here!";
   sortType = 'all';
 
killedBy: Search check input field
statusReason: Error: expect(element).toHaveValue(Test)

Expected the element to have value:
  Test
Received:
  Stryker was here!Test

[Killed] BlockStatement
client/src/store/todo.store.ts:19:33
   query = '';
   sortType = 'all';
 
-  setTitle = (value: string) => {
-    this.title = value;
-  };
+  setTitle = (value: string) => {};
 
   setQuery = (value: string) => {
killedBy: TodoApp check component operation
statusReason: Error: expect(element).toHaveValue(Press Enter)

Expected the element to have value:
  Press Enter
Received:

[Killed] BlockStatement
client/src/store/todo.store.ts:23:33
     this.title = value;
   };
 
-  setQuery = (value: string) => {
-    this.query = value;
-  };
+  setQuery = (value: string) => {};
 
   setSortType = (value: string) => {
killedBy: Search check input field
statusReason: Error: expect(element).toHaveValue(Test)

Expected the element to have value:
  Test
Received:

[Timeout] BlockStatement
client/src/store/todo.store.ts:27:36
     this.query = value;
   };
 
-  setSortType = (value: string) => {
-    this.sortType = value;
-  };
+  setSortType = (value: string) => {};
 
   deleteTodo = async (id: string) => {

[Timeout] BlockStatement
client/src/store/todo.store.ts:31:38
     this.sortType = value;
   };
 
-  deleteTodo = async (id: string) => {
-    try {
-      this.todos = this.todos.filter((todo) => todo.id !== id);
-      this.renderTodos = this.todos;
-      await deleteTodo(id);
-    } catch (e: any) {
-      this.requestError = e;
-    }
-  };
+  deleteTodo = async (id: string) => {};
 
   markTodo = async (id: string) => {

[Timeout] BlockStatement
client/src/store/todo.store.ts:32:9
   };
 
   deleteTodo = async (id: string) => {
-    try {
-      this.todos = this.todos.filter((todo) => todo.id !== id);
-      this.renderTodos = this.todos;
-      await deleteTodo(id);
-    } catch (e: any) {
+    try {} catch (e: any) {
       this.requestError = e;
     }

[Timeout] ConditionalExpression
client/src/store/todo.store.ts:33:48
 
   deleteTodo = async (id: string) => {
     try {
-      this.todos = this.todos.filter((todo) => todo.id !== id);
+      this.todos = this.todos.filter((todo) => false);
       this.renderTodos = this.todos;
       await deleteTodo(id);

[Timeout] ConditionalExpression
client/src/store/todo.store.ts:33:48
 
   deleteTodo = async (id: string) => {
     try {
-      this.todos = this.todos.filter((todo) => todo.id !== id);
+      this.todos = this.todos.filter((todo) => true);
       this.renderTodos = this.todos;
       await deleteTodo(id);

[Timeout] BlockStatement
client/src/store/todo.store.ts:36:22
       this.todos = this.todos.filter((todo) => todo.id !== id);
       this.renderTodos = this.todos;
       await deleteTodo(id);
-    } catch (e: any) {
-      this.requestError = e;
-    }
+    } catch (e: any) {}
   };
 

[Killed] BlockStatement
client/src/store/todo.store.ts:41:36
     }
   };
 
-  markTodo = async (id: string) => {
-    let currentMark;
-    try {
-      this.todos = this.todos.map((todo) => {
-        if (todo.id === id) {
-          currentMark = !todo.mark;
-          return { ...todo, mark: currentMark };
-        }
-        return todo;
-      });
-
-      this.renderTodos = this.todos;
-      await updateTodo({ _id: id, mark: currentMark });
-      this.todoFilter(this.query);
-    } catch (e: any) {
-      this.requestError = e;
-    }
-  };
+  markTodo = async (id: string) => {};
 
   setStatus = async (id: string) => {
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
client/src/store/todo.store.ts:43:9
 
   markTodo = async (id: string) => {
     let currentMark;
-    try {
-      this.todos = this.todos.map((todo) => {
-        if (todo.id === id) {
-          currentMark = !todo.mark;
-          return { ...todo, mark: currentMark };
-        }
-        return todo;
-      });
-
-      this.renderTodos = this.todos;
-      await updateTodo({ _id: id, mark: currentMark });
-      this.todoFilter(this.query);
-    } catch (e: any) {
+    try {} catch (e: any) {
       this.requestError = e;
     }
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
client/src/store/todo.store.ts:44:45
   markTodo = async (id: string) => {
     let currentMark;
     try {
-      this.todos = this.todos.map((todo) => {
-        if (todo.id === id) {
-          currentMark = !todo.mark;
-          return { ...todo, mark: currentMark };
-        }
-        return todo;
-      });
+      this.todos = this.todos.map((todo) => {});
 
       this.renderTodos = this.todos;
killedBy: TodoList check component operation
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
client/src/store/todo.store.ts:45:13
     let currentMark;
     try {
       this.todos = this.todos.map((todo) => {
-        if (todo.id === id) {
+        if (todo.id !== id) {
           currentMark = !todo.mark;
           return { ...todo, mark: currentMark };
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
client/src/store/todo.store.ts:45:13
     let currentMark;
     try {
       this.todos = this.todos.map((todo) => {
-        if (todo.id === id) {
+        if (false) {
           currentMark = !todo.mark;
           return { ...todo, mark: currentMark };
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
client/src/store/todo.store.ts:46:25
     try {
       this.todos = this.todos.map((todo) => {
         if (todo.id === id) {
-          currentMark = !todo.mark;
+          currentMark = todo.mark;
           return { ...todo, mark: currentMark };
         }
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] BlockStatement
client/src/store/todo.store.ts:55:22
       this.renderTodos = this.todos;
       await updateTodo({ _id: id, mark: currentMark });
       this.todoFilter(this.query);
-    } catch (e: any) {
-      this.requestError = e;
-    }
+    } catch (e: any) {}
   };
 

[Killed] BlockStatement
client/src/store/todo.store.ts:60:37
     }
   };
 
-  setStatus = async (id: string) => {
-    let currentStatus;
-    try {
-      this.todos = this.todos.map((todo) => {
-        if (todo.id === id) {
-          currentStatus = !todo.status;
-          return { ...todo, status: currentStatus };
-        }
-        return todo;
-      });
-
-      this.renderTodos = this.todos;
-      this.todoFilter(this.query);
-      await updateTodo({ _id: id, status: currentStatus });
-    } catch (e: any) {
-      this.requestError = e;
-    }
-  };
+  setStatus = async (id: string) => {};
 
   statusFilter = () => {
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
client/src/store/todo.store.ts:62:9
 
   setStatus = async (id: string) => {
     let currentStatus;
-    try {
-      this.todos = this.todos.map((todo) => {
-        if (todo.id === id) {
-          currentStatus = !todo.status;
-          return { ...todo, status: currentStatus };
-        }
-        return todo;
-      });
-
-      this.renderTodos = this.todos;
-      this.todoFilter(this.query);
-      await updateTodo({ _id: id, status: currentStatus });
-    } catch (e: any) {
+    try {} catch (e: any) {
       this.requestError = e;
     }
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
client/src/store/todo.store.ts:63:45
   setStatus = async (id: string) => {
     let currentStatus;
     try {
-      this.todos = this.todos.map((todo) => {
-        if (todo.id === id) {
-          currentStatus = !todo.status;
-          return { ...todo, status: currentStatus };
-        }
-        return todo;
-      });
+      this.todos = this.todos.map((todo) => {});
 
       this.renderTodos = this.todos;
killedBy: TodoList check component operation
statusReason: TypeError: Cannot read properties of undefined (reading 'title')

[Killed] BlockStatement
client/src/store/todo.store.ts:64:29
     let currentStatus;
     try {
       this.todos = this.todos.map((todo) => {
-        if (todo.id === id) {
-          currentStatus = !todo.status;
-          return { ...todo, status: currentStatus };
-        }
+        if (todo.id === id) {}
         return todo;
       });
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
client/src/store/todo.store.ts:65:27
     try {
       this.todos = this.todos.map((todo) => {
         if (todo.id === id) {
-          currentStatus = !todo.status;
+          currentStatus = todo.status;
           return { ...todo, status: currentStatus };
         }
killedBy: TodoList check component operation
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Survived] BlockStatement
client/src/store/todo.store.ts:74:22
       this.renderTodos = this.todos;
       this.todoFilter(this.query);
       await updateTodo({ _id: id, status: currentStatus });
-    } catch (e: any) {
-      this.requestError = e;
-    }
+    } catch (e: any) {}
   };
 

[Survived] BlockStatement
client/src/store/todo.store.ts:79:24
     }
   };
 
-  statusFilter = () => {
-    if (this.sortType === 'active') {
-      this.renderTodos = this.todos.filter((todo) => !todo.status);
-    } else if (this.sortType === 'done') {
-      this.renderTodos = this.todos.filter((todo) => todo.status);
-    } else {
-      this.renderTodos = this.todos;
-    }
-  };
+  statusFilter = () => {};
 
   searchFilter = (value: string) => {

[Killed] EqualityOperator
client/src/store/todo.store.ts:80:9
   };
 
   statusFilter = () => {
-    if (this.sortType === 'active') {
+    if (this.sortType !== 'active') {
       this.renderTodos = this.todos.filter((todo) => !todo.status);
     } else if (this.sortType === 'done') {
killedBy: TodoList check component operation
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
client/src/store/todo.store.ts:80:9
   };
 
   statusFilter = () => {
-    if (this.sortType === 'active') {
+    if (true) {
       this.renderTodos = this.todos.filter((todo) => !todo.status);
     } else if (this.sortType === 'done') {
killedBy: TodoList check component operation
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Survived] ArrowFunction
client/src/store/todo.store.ts:81:44
 
   statusFilter = () => {
     if (this.sortType === 'active') {
-      this.renderTodos = this.todos.filter((todo) => !todo.status);
+      this.renderTodos = this.todos.filter(() => undefined);
     } else if (this.sortType === 'done') {
       this.renderTodos = this.todos.filter((todo) => todo.status);

[Survived] BooleanLiteral
client/src/store/todo.store.ts:81:54
 
   statusFilter = () => {
     if (this.sortType === 'active') {
-      this.renderTodos = this.todos.filter((todo) => !todo.status);
+      this.renderTodos = this.todos.filter((todo) => todo.status);
     } else if (this.sortType === 'done') {
       this.renderTodos = this.todos.filter((todo) => todo.status);

[Survived] EqualityOperator
client/src/store/todo.store.ts:82:16
   statusFilter = () => {
     if (this.sortType === 'active') {
       this.renderTodos = this.todos.filter((todo) => !todo.status);
-    } else if (this.sortType === 'done') {
+    } else if (this.sortType !== 'done') {
       this.renderTodos = this.todos.filter((todo) => todo.status);
     } else {

[Survived] ConditionalExpression
client/src/store/todo.store.ts:82:16
   statusFilter = () => {
     if (this.sortType === 'active') {
       this.renderTodos = this.todos.filter((todo) => !todo.status);
-    } else if (this.sortType === 'done') {
+    } else if (false) {
       this.renderTodos = this.todos.filter((todo) => todo.status);
     } else {

[Survived] ArrowFunction
client/src/store/todo.store.ts:83:44
     if (this.sortType === 'active') {
       this.renderTodos = this.todos.filter((todo) => !todo.status);
     } else if (this.sortType === 'done') {
-      this.renderTodos = this.todos.filter((todo) => todo.status);
+      this.renderTodos = this.todos.filter(() => undefined);
     } else {
       this.renderTodos = this.todos;

[Survived] BlockStatement
client/src/store/todo.store.ts:84:12
       this.renderTodos = this.todos.filter((todo) => !todo.status);
     } else if (this.sortType === 'done') {
       this.renderTodos = this.todos.filter((todo) => todo.status);
-    } else {
-      this.renderTodos = this.todos;
-    }
+    } else {}
   };
 

[Killed] BlockStatement
client/src/store/todo.store.ts:89:37
     }
   };
 
-  searchFilter = (value: string) => {
-    const reg = new RegExp(value, 'gi');
-
-    this.renderTodos = this.renderTodos.filter((todo) => todo.title.match(reg));
-  };
+  searchFilter = (value: string) => {};
 
   todoFilter = (value: string) => {
killedBy: Search check input field
statusReason: Error: expect(received).toBeNull()

Received: <div class="css-0" data-testid="todoItemTitle">Todo content</div>

[Killed] ArrowFunction
client/src/store/todo.store.ts:92:48
   searchFilter = (value: string) => {
     const reg = new RegExp(value, 'gi');
 
-    this.renderTodos = this.renderTodos.filter((todo) => todo.title.match(reg));
+    this.renderTodos = this.renderTodos.filter(() => undefined);
   };
 
killedBy: TodoList check component operation
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
client/src/store/todo.store.ts:95:35
     this.renderTodos = this.renderTodos.filter((todo) => todo.title.match(reg));
   };
 
-  todoFilter = (value: string) => {
-    this.statusFilter();
-    this.searchFilter(value);
-  };
+  todoFilter = (value: string) => {};
 
   setTodos = async (value: IState) => {
killedBy: Search check input field
statusReason: Error: expect(received).toBeNull()

Received: <div class="css-0" data-testid="todoItemTitle">Todo content</div>

[Survived] BlockStatement
client/src/store/todo.store.ts:100:39
     this.searchFilter(value);
   };
 
-  setTodos = async (value: IState) => {
-    try {
-      const result = await createTodo(value);
-      if (!result) return console.log('Server error');
-
-      if (result.status === 200) {
-        const { data } = result;
-        this.todos.push({ ...data, id: data._id });
-        this.renderTodos = this.todos;
-        this.todoFilter(this.query);
-      }
-      this.title = '';
-    } catch (e: any) {
-      this.requestError = e;
-    }
-  };
+  setTodos = async (value: IState) => {};
 
   setTodosTest = async (value: ITodos) => {

[Survived] BlockStatement
client/src/store/todo.store.ts:101:9
   };
 
   setTodos = async (value: IState) => {
-    try {
-      const result = await createTodo(value);
-      if (!result) return console.log('Server error');
-
-      if (result.status === 200) {
-        const { data } = result;
-        this.todos.push({ ...data, id: data._id });
-        this.renderTodos = this.todos;
-        this.todoFilter(this.query);
-      }
-      this.title = '';
-    } catch (e: any) {
+    try {} catch (e: any) {
       this.requestError = e;
     }

[Survived] ConditionalExpression
client/src/store/todo.store.ts:103:11
   setTodos = async (value: IState) => {
     try {
       const result = await createTodo(value);
-      if (!result) return console.log('Server error');
+      if (false) return console.log('Server error');
 
       if (result.status === 200) {

[Survived] ConditionalExpression
client/src/store/todo.store.ts:103:11
   setTodos = async (value: IState) => {
     try {
       const result = await createTodo(value);
-      if (!result) return console.log('Server error');
+      if (true) return console.log('Server error');
 
       if (result.status === 200) {

[Survived] ConditionalExpression
client/src/store/todo.store.ts:105:11
       const result = await createTodo(value);
       if (!result) return console.log('Server error');
 
-      if (result.status === 200) {
+      if (false) {
         const { data } = result;
         this.todos.push({ ...data, id: data._id });

[Survived] BlockStatement
client/src/store/todo.store.ts:105:34
       const result = await createTodo(value);
       if (!result) return console.log('Server error');
 
-      if (result.status === 200) {
-        const { data } = result;
-        this.todos.push({ ...data, id: data._id });
-        this.renderTodos = this.todos;
-        this.todoFilter(this.query);
-      }
+      if (result.status === 200) {}
       this.title = '';
     } catch (e: any) {

[Survived] ObjectLiteral
client/src/store/todo.store.ts:107:25
 
       if (result.status === 200) {
         const { data } = result;
-        this.todos.push({ ...data, id: data._id });
+        this.todos.push({});
         this.renderTodos = this.todos;
         this.todoFilter(this.query);

[Survived] StringLiteral
client/src/store/todo.store.ts:111:20
         this.renderTodos = this.todos;
         this.todoFilter(this.query);
       }
-      this.title = '';
+      this.title = "Stryker was here!";
     } catch (e: any) {
       this.requestError = e;

[Survived] BlockStatement
client/src/store/todo.store.ts:112:22
         this.todoFilter(this.query);
       }
       this.title = '';
-    } catch (e: any) {
-      this.requestError = e;
-    }
+    } catch (e: any) {}
   };
 

[Killed] BlockStatement
client/src/store/todo.store.ts:117:43
     }
   };
 
-  setTodosTest = async (value: ITodos) => {
-    this.todos.push(value);
-    this.renderTodos = this.todos;
-  };
+  setTodosTest = async (value: ITodos) => {};
 
   getTodos = async () => {
killedBy: Search check input field
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Survived] BlockStatement
client/src/store/todo.store.ts:122:26
     this.renderTodos = this.todos;
   };
 
-  getTodos = async () => {
-    try {
-      this.isLoading = true;
-
-      const result = await getAllTodos();
-      await delay(1000);
-
-      if (!result) return console.log('Server error');
-
-      if (result.status === 200) {
-        this.todos = result.data.map((todo: ITodos) => ({
-          ...todo,
-          id: todo._id,
-        }));
-        this.renderTodos = this.todos;
-      }
-    } catch (e: any) {
-      this.requestError = e;
-    } finally {
-      this.isLoading = false;
-    }
-  };
+  getTodos = async () => {};
 
   get done() {

[Survived] BlockStatement
client/src/store/todo.store.ts:123:9
   };
 
   getTodos = async () => {
-    try {
-      this.isLoading = true;
-
-      const result = await getAllTodos();
-      await delay(1000);
-
-      if (!result) return console.log('Server error');
-
-      if (result.status === 200) {
-        this.todos = result.data.map((todo: ITodos) => ({
-          ...todo,
-          id: todo._id,
-        }));
-        this.renderTodos = this.todos;
-      }
-    } catch (e: any) {
+    try {} catch (e: any) {
       this.requestError = e;
     } finally {

[Survived] BooleanLiteral
client/src/store/todo.store.ts:124:24
 
   getTodos = async () => {
     try {
-      this.isLoading = true;
+      this.isLoading = false;
 
       const result = await getAllTodos();

[Survived] BooleanLiteral
client/src/store/todo.store.ts:129:11
       const result = await getAllTodos();
       await delay(1000);
 
-      if (!result) return console.log('Server error');
+      if (result) return console.log('Server error');
 
       if (result.status === 200) {

[Survived] ConditionalExpression
client/src/store/todo.store.ts:129:11
       const result = await getAllTodos();
       await delay(1000);
 
-      if (!result) return console.log('Server error');
+      if (true) return console.log('Server error');
 
       if (result.status === 200) {

[Survived] ConditionalExpression
client/src/store/todo.store.ts:131:11
 
       if (!result) return console.log('Server error');
 
-      if (result.status === 200) {
+      if (true) {
         this.todos = result.data.map((todo: ITodos) => ({
           ...todo,

[Survived] BlockStatement
client/src/store/todo.store.ts:131:34
 
       if (!result) return console.log('Server error');
 
-      if (result.status === 200) {
-        this.todos = result.data.map((todo: ITodos) => ({
-          ...todo,
-          id: todo._id,
-        }));
-        this.renderTodos = this.todos;
-      }
+      if (result.status === 200) {}
     } catch (e: any) {
       this.requestError = e;

[Survived] ArrowFunction
client/src/store/todo.store.ts:132:38
       if (!result) return console.log('Server error');
 
       if (result.status === 200) {
-        this.todos = result.data.map((todo: ITodos) => ({
-          ...todo,
-          id: todo._id,
-        }));
+        this.todos = result.data.map(() => undefined);
         this.renderTodos = this.todos;
       }

[Survived] BlockStatement
client/src/store/todo.store.ts:138:22
         }));
         this.renderTodos = this.todos;
       }
-    } catch (e: any) {
-      this.requestError = e;
-    } finally {
+    } catch (e: any) {} finally {
       this.isLoading = false;
     }

[Survived] BlockStatement
client/src/store/todo.store.ts:140:15
       }
     } catch (e: any) {
       this.requestError = e;
-    } finally {
-      this.isLoading = false;
-    }
+    } finally {}
   };
 

[Survived] BlockStatement
client/src/store/todo.store.ts:145:14
     }
   };
 
-  get done() {
-    return this.todos.filter((todo) => todo.status).length;
-  }
+  get done() {}
 
   get active() {

[Survived] ArrowFunction
client/src/store/todo.store.ts:146:30
   };
 
   get done() {
-    return this.todos.filter((todo) => todo.status).length;
+    return this.todos.filter(() => undefined).length;
   }
 

[Survived] BlockStatement
client/src/store/todo.store.ts:149:16
     return this.todos.filter((todo) => todo.status).length;
   }
 
-  get active() {
-    return this.todos.filter((todo) => !todo.status).length;
-  }
+  get active() {}
 }
 

[Survived] ArrowFunction
client/src/store/todo.store.ts:150:30
   }
 
   get active() {
-    return this.todos.filter((todo) => !todo.status).length;
+    return this.todos.filter(() => undefined).length;
   }
 }

[Survived] BooleanLiteral
client/src/store/todo.store.ts:150:40
   }
 
   get active() {
-    return this.todos.filter((todo) => !todo.status).length;
+    return this.todos.filter((todo) => todo.status).length;
   }
 }
