[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:6:10
 import { Btn } from '../../../components/Btn';
 
 const meta: Meta = {
-  title: 'Components | Button',
+  title: "",
   id: 'components/Button',
   component: Btn,

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:7:7
 
 const meta: Meta = {
   title: 'Components | Button',
-  id: 'components/Button',
+  id: "",
   component: Btn,
   argTypes: {

[Survived] ObjectLiteral
stories/components/Btn/Btn.stories.tsx:10:15
   id: 'components/Button',
   component: Btn,
   argTypes: {
-    children: {
-      type: 'string',
-      name: 'Content',
-      description: 'Название кнопки',
-      defaultValue: 'Button',
-    },
+    children: {},
 
     styleBtn: {

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:11:13
   component: Btn,
   argTypes: {
     children: {
-      type: 'string',
+      type: "",
       name: 'Content',
       description: 'Название кнопки',

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:13:20
     children: {
       type: 'string',
       name: 'Content',
-      description: 'Название кнопки',
+      description: "",
       defaultValue: 'Button',
     },

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:18:13
     },
 
     styleBtn: {
-      type: 'string',
+      type: "",
       name: 'Button style',
       description: 'Тип оформления кнопки',

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:26:20
     type: {
       type: 'string',
       name: 'Type',
-      description: 'Тип кнопки',
+      description: "",
       defaultValue: 'button',
     },

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:27:21
       type: 'string',
       name: 'Type',
       description: 'Тип кнопки',
-      defaultValue: 'button',
+      defaultValue: "",
     },
 

[Survived] ObjectLiteral
stories/components/Btn/Btn.stories.tsx:36:17
       description: 'Name кнопки',
     },
 
-    isDisabled: {
-      type: 'boolean',
-      name: 'Disabled',
-      description: 'Статус disabled кнопки',
-      defaultValue: false,
-    },
+    isDisabled: {},
 
     testid: {

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:38:13
 
     isDisabled: {
       type: 'boolean',
-      name: 'Disabled',
+      name: "",
       description: 'Статус disabled кнопки',
       defaultValue: false,

[Survived] BooleanLiteral
stories/components/Btn/Btn.stories.tsx:40:21
       type: 'boolean',
       name: 'Disabled',
       description: 'Статус disabled кнопки',
-      defaultValue: false,
+      defaultValue: true,
     },
 

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:44:13
     },
 
     testid: {
-      type: 'string',
+      type: "",
       name: 'Data attribute',
       description: 'Test ID компонента Btn',

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:45:13
 
     testid: {
       type: 'string',
-      name: 'Data attribute',
+      name: "",
       description: 'Test ID компонента Btn',
       defaultValue: 'todoBtn',

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:47:21
       type: 'string',
       name: 'Data attribute',
       description: 'Test ID компонента Btn',
-      defaultValue: 'todoBtn',
+      defaultValue: "",
     },
 

[Survived] ObjectLiteral
stories/components/Btn/Btn.stories.tsx:50:15
       defaultValue: 'todoBtn',
     },
 
-    isActive: {
-      type: 'boolean',
-      name: 'Active state',
-      description: 'Состояние active компонента Btn',
-      defaultValue: 'false',
-    },
+    isActive: {},
 
     handleClick: {

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:60:15
     handleClick: {
       name: 'Click Handler | Todo Item',
       description: 'Обработчик клика по кнопке',
-      action: 'hadleClick',
+      action: "",
     },
 

[Survived] BooleanLiteral
stories/components/Btn/Btn.stories.tsx:63:35
       action: 'hadleClick',
     },
 
-    disabled: { table: { disable: true } },
+    disabled: { table: { disable: false } },
   },
 };

[Survived] ObjectLiteral
stories/components/Btn/Btn.stories.tsx:63:15
       action: 'hadleClick',
     },
 
-    disabled: { table: { disable: true } },
+    disabled: {},
   },
 };

[Survived] ArrowFunction
stories/components/Btn/Btn.stories.tsx:69:25
 
 export default meta;
 
-const Template: Story = (args) => <Btn {...args} />;
+const Template: Story = () => undefined;
 
 export const DeleteBtn = Template.bind({});

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:75:13
 
 DeleteBtn.args = {
   children: 'Delete',
-  styleBtn: 'deleteBtn',
+  styleBtn: "",
   name: 'delete',
   disabled: false,

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:76:9
 DeleteBtn.args = {
   children: 'Delete',
   styleBtn: 'deleteBtn',
-  name: 'delete',
+  name: "",
   disabled: false,
 };

[Survived] BooleanLiteral
stories/components/Btn/Btn.stories.tsx:77:13
   children: 'Delete',
   styleBtn: 'deleteBtn',
   name: 'delete',
-  disabled: false,
+  disabled: true,
 };
 

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:83:13
 export const MarkBtn = Template.bind({});
 
 MarkBtn.args = {
-  children: 'Mark',
+  children: "",
   styleBtn: 'markBtn',
   name: 'mark',

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:85:9
 MarkBtn.args = {
   children: 'Mark',
   styleBtn: 'markBtn',
-  name: 'mark',
+  name: "",
   disabled: false,
 };

[Survived] BooleanLiteral
stories/components/Btn/Btn.stories.tsx:86:13
   children: 'Mark',
   styleBtn: 'markBtn',
   name: 'mark',
-  disabled: false,
+  disabled: true,
 };
 

[Survived] StringLiteral
stories/components/Btn/Btn.stories.tsx:92:13
 export const ManageBtn = Template.bind({});
 
 ManageBtn.args = {
-  children: 'Add',
+  children: "",
   styleBtn: 'manageBtn',
   name: 'add',

[Survived] BooleanLiteral
stories/components/Btn/Btn.stories.tsx:95:13
   children: 'Add',
   styleBtn: 'manageBtn',
   name: 'add',
-  disabled: false,
+  disabled: true,
   isActive: false,
 };

[Survived] BooleanLiteral
stories/components/Btn/Btn.stories.tsx:96:13
   styleBtn: 'manageBtn',
   name: 'add',
   disabled: false,
-  isActive: false,
+  isActive: true,
 };
 
