[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:7:7
 
 const meta: Meta = {
   title: 'Components | Input',
-  id: 'components/Input',
+  id: "",
   component: Input,
   argTypes: {

[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:12:13
   argTypes: {
     placeholder: {
       type: 'string',
-      name: 'Placeholder',
+      name: "",
       description: 'Placeholder компонента Input',
       defaultValue: 'What needs to be done?',

[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:13:20
     placeholder: {
       type: 'string',
       name: 'Placeholder',
-      description: 'Placeholder компонента Input',
+      description: "",
       defaultValue: 'What needs to be done?',
     },

[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:18:13
     },
 
     name: {
-      type: 'string',
+      type: "",
       name: 'Input Name',
       description: 'Name компонента Input',

[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:19:13
 
     name: {
       type: 'string',
-      name: 'Input Name',
+      name: "",
       description: 'Name компонента Input',
       defaultValue: 'todoAdd',

[Survived] ObjectLiteral
stories/components/Input/Input.stories.tsx:24:11
       defaultValue: 'todoAdd',
     },
 
-    type: {
-      type: 'string',
-      name: 'Input Type',
-      description: 'Type компонента Input',
-      defaultValue: 'text',
-    },
+    type: {},
 
     className: {

[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:26:13
 
     type: {
       type: 'string',
-      name: 'Input Type',
+      name: "",
       description: 'Type компонента Input',
       defaultValue: 'text',

[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:28:21
       type: 'string',
       name: 'Input Type',
       description: 'Type компонента Input',
-      defaultValue: 'text',
+      defaultValue: "",
     },
 

[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:34:20
     className: {
       type: 'string',
       name: 'Class Name',
-      description: 'Class name компонента Input',
+      description: "",
       defaultValue: 'todoAddField',
     },

[Survived] ObjectLiteral
stories/components/Input/Input.stories.tsx:51:19
       description: 'Value компонента Input',
     },
 
-    handleChange: {
-      name: 'Change Handler | Input',
-      description: 'Обработчик ввода текста',
-      action: 'hadleChange',
-    },
+    handleChange: {},
 
     handleKey: {

[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:53:20
 
     handleChange: {
       name: 'Change Handler | Input',
-      description: 'Обработчик ввода текста',
+      description: "",
       action: 'hadleChange',
     },

[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:54:15
     handleChange: {
       name: 'Change Handler | Input',
       description: 'Обработчик ввода текста',
-      action: 'hadleChange',
+      action: "",
     },
 

[Survived] ObjectLiteral
stories/components/Input/Input.stories.tsx:57:16
       action: 'hadleChange',
     },
 
-    handleKey: {
-      name: 'Press Key Handler | Input',
-      description: 'Обработчик нажатия клавиши Enter',
-      action: 'pressKey',
-    },
+    handleKey: {},
   },
 };

[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:58:13
     },
 
     handleKey: {
-      name: 'Press Key Handler | Input',
+      name: "",
       description: 'Обработчик нажатия клавиши Enter',
       action: 'pressKey',

[Survived] StringLiteral
stories/components/Input/Input.stories.tsx:60:15
     handleKey: {
       name: 'Press Key Handler | Input',
       description: 'Обработчик нажатия клавиши Enter',
-      action: 'pressKey',
+      action: "",
     },
   },

[Survived] ArrowFunction
stories/components/Input/Input.stories.tsx:67:25
 
 export default meta;
 
-const Template: Story = (args) => <Input {...args} />;
+const Template: Story = () => undefined;
 
 export const Default = Template.bind({});
