[Survived] StringLiteral
stories/components/TodoItem/TodoItem.stories.tsx:14:21
       type: 'string',
       name: 'Item ID',
       description: 'Идентификатор кнопки',
-      defaultValue: '1',
+      defaultValue: "",
     },
 

[Survived] StringLiteral
stories/components/TodoItem/TodoItem.stories.tsx:19:13
 
     key: {
       type: 'string',
-      name: 'Key',
+      name: "",
       description: 'Уникальный key для TodoItem',
       defaultValue: '1',

[Survived] StringLiteral
stories/components/TodoItem/TodoItem.stories.tsx:21:21
       type: 'string',
       name: 'Key',
       description: 'Уникальный key для TodoItem',
-      defaultValue: '1',
+      defaultValue: "",
     },
 

[Survived] ObjectLiteral
stories/components/TodoItem/TodoItem.stories.tsx:31:11
       defaultValue: 'Прочитаь книгу',
     },
 
-    mark: {
-      type: 'boolean',
-      name: 'Mark',
-      description: 'Отметить TodoItem как важное',
-      defaultValue: false,
-    },
+    mark: {},
 
     status: {

[Survived] BooleanLiteral
stories/components/TodoItem/TodoItem.stories.tsx:35:21
       type: 'boolean',
       name: 'Mark',
       description: 'Отметить TodoItem как важное',
-      defaultValue: false,
+      defaultValue: true,
     },
 

[Survived] StringLiteral
stories/components/TodoItem/TodoItem.stories.tsx:41:20
     status: {
       type: 'boolean',
       name: 'Status',
-      description: 'Текущий статус выполнения TodoItem',
+      description: "",
       defaultValue: false,
     },

[Survived] BooleanLiteral
stories/components/TodoItem/TodoItem.stories.tsx:42:21
       type: 'boolean',
       name: 'Status',
       description: 'Текущий статус выполнения TodoItem',
-      defaultValue: false,
+      defaultValue: true,
     },
 

[Survived] StringLiteral
stories/components/TodoItem/TodoItem.stories.tsx:46:13
     },
 
     count: {
-      type: 'string',
+      type: "",
       name: 'Count',
       description: 'Положение TodoItem в очереди',

[Survived] StringLiteral
stories/components/TodoItem/TodoItem.stories.tsx:47:13
 
     count: {
       type: 'string',
-      name: 'Count',
+      name: "",
       description: 'Положение TodoItem в очереди',
       defaultValue: '1',

[Survived] StringLiteral
stories/components/TodoItem/TodoItem.stories.tsx:55:15
     handleClickDel: {
       name: 'Click Handler | Del btn',
       description: 'Обработчик кнопки удаления',
-      action: 'hadleClick',
+      action: "",
     },
 

[Survived] StringLiteral
stories/components/TodoItem/TodoItem.stories.tsx:60:20
 
     handleClickMark: {
       name: 'Click Handler | Mark btn',
-      description: 'Обработчик кнопки выделения',
+      description: "",
       action: 'hadleClick',
     },

[Survived] StringLiteral
stories/components/TodoItem/TodoItem.stories.tsx:65:13
     },
 
     handleClickStatus: {
-      name: 'Click Handler | Todo Item',
+      name: "",
       description: 'Обработчик статуса выполнения',
       action: 'hadleClick',

[Survived] ArrowFunction
stories/components/TodoItem/TodoItem.stories.tsx:74:25
 
 export default meta;
 
-const Template: Story = (args) => <TodoItem {...args} />;
+const Template: Story = () => undefined;
 
 export const Default = Template.bind({});

[Survived] BooleanLiteral
stories/components/TodoItem/TodoItem.stories.tsx:82:9
   id: 1,
   key: 1,
   title: 'Todo this',
-  mark: false,
+  mark: true,
   status: false,
   count: 1,

[Survived] BooleanLiteral
stories/components/TodoItem/TodoItem.stories.tsx:83:11
   key: 1,
   title: 'Todo this',
   mark: false,
-  status: false,
+  status: true,
   count: 1,
 };
