[Timeout] StringLiteral
client/src/styles/globalStyle.ts:86:20
     font-weight: 400;
     font-size: 16px;
     line-height: 1.5;
-    color: ${color['black-color']};
+    color: ${color[""]};
 
     background-color: ${color['white-color']};

[Timeout] StringLiteral
client/src/styles/globalStyle.ts:88:31
     line-height: 1.5;
     color: ${color['black-color']};
 
-    background-color: ${color['white-color']};
+    background-color: ${color[""]};
 
     user-select: none;
