[Survived] StringLiteral
client/src/styles/variables.ts:6:18
 }
 
 export const color: IColor = {
-  'white-color': '#ffffff',
+  'white-color': "",
   'green-color': '#26851b',
   'green-color--light': '#0f972d85',

[Survived] StringLiteral
client/src/styles/variables.ts:8:25
 export const color: IColor = {
   'white-color': '#ffffff',
   'green-color': '#26851b',
-  'green-color--light': '#0f972d85',
+  'green-color--light': "",
   'blue-color': '#3b43b3',
   'gray-color': '#9e9e9e',

[Survived] StringLiteral
client/src/styles/variables.ts:11:23
   'green-color--light': '#0f972d85',
   'blue-color': '#3b43b3',
   'gray-color': '#9e9e9e',
-  'red-color--light': '#ffe5e5',
+  'red-color--light': "",
   'black-color--light': '#d9d9e1',
   primary: '#D43728',
