[Survived] ObjectLiteral
client/src/utils/axiosInstance.utils.ts:3:36
 import axios from 'axios';
 
-const axiosInstance = axios.create({
-  baseURL: 'https://cryptic-ravine-29648.herokuapp.com/todos',
-});
+const axiosInstance = axios.create({});
 
 export { axiosInstance };
