[Killed] ArrowFunction
client/src/utils/delay.utils.ts:1:15
-const delay = (ms: number, callback?: any) =>
-  new Promise<void>((res) =>
-    setTimeout(() => {
-      res();
-      if (typeof callback === 'function') callback();
-    }, ms),
-  );
+const delay = () => undefined;
 
 export { delay };
killedBy: delay on 1 second
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrowFunction
client/src/utils/delay.utils.ts:2:21
 const delay = (ms: number, callback?: any) =>
-  new Promise<void>((res) =>
-    setTimeout(() => {
-      res();
-      if (typeof callback === 'function') callback();
-    }, ms),
+  new Promise<void>(() => undefined,
   );
 
killedBy: delay on 1 second
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
client/src/utils/delay.utils.ts:3:22
 const delay = (ms: number, callback?: any) =>
   new Promise<void>((res) =>
-    setTimeout(() => {
-      res();
-      if (typeof callback === 'function') callback();
-    }, ms),
+    setTimeout(() => {}, ms),
   );
 
killedBy: delay on 1 second
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
client/src/utils/delay.utils.ts:5:11
   new Promise<void>((res) =>
     setTimeout(() => {
       res();
-      if (typeof callback === 'function') callback();
+      if (typeof callback !== 'function') callback();
     }, ms),
   );
killedBy: delay on 1 second
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
client/src/utils/delay.utils.ts:5:11
   new Promise<void>((res) =>
     setTimeout(() => {
       res();
-      if (typeof callback === 'function') callback();
+      if (false) callback();
     }, ms),
   );
killedBy: delay on 1 second
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0
