[Killed] ArrowFunction
client/src/utils/storage.utils.ts:1:20
-export const set = (name: string, value: any): void =>
-  window.localStorage.setItem(name, JSON.stringify(value));
+export const set = () => undefined;
 
 export const get = (name: string): any => {
killedBy: storageUtils return data from localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "foo", "\"bar\""

Number of calls: 0

[Killed] BlockStatement
client/src/utils/storage.utils.ts:4:43
 export const set = (name: string, value: any): void =>
   window.localStorage.setItem(name, JSON.stringify(value));
 
-export const get = (name: string): any => {
-  const result = localStorage.getItem(name);
-  return result ? JSON.parse(result) : null;
-};
+export const get = (name: string): any => {};
 
 export const del = (name: string): void => localStorage.removeItem(name);
killedBy: storageUtils return data from localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "foo"

Number of calls: 0

[Killed] ArrowFunction
client/src/utils/storage.utils.ts:9:20
   return result ? JSON.parse(result) : null;
 };
 
-export const del = (name: string): void => localStorage.removeItem(name);
+export const del = () => undefined;
 
killedBy: storageUtils return data from localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenLastCalledWith(...expected)

Expected: "foo"

Number of calls: 0
